toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        _Scheduler::Start<_SDTask>([] { _SDCard::Disable(); });
    }
    
    static void Wait() {
        _Scheduler::Wait<_SDTask>();
    }
    
    static void WriteImage(uint8_t srcBlock, uint16_t dstIdx) {
        _SDCard::WriteImage(_RCA, srcBlock, dstIdx);
    }
    
private:
    static inline bool _Enabled = false;
    static inline uint16_t _RCA = 0;
    
    // _ResetState(): resets the _State.sd struct
    static void _ResetState(const SD::CardId& cardId, const SD::CardData& cardData) {
        FRAMWriteEn writeEn; // Enable FRAM writing
        
        // Mark the _State as invalid in case we lose power in the middle of modifying it
        _State.sd.valid = false;
        
        // Set .cardId
        {
            _State.sd.cardId = cardId;
        }
        
        // Set .imgCap
        {
            // ImgBlockLen: the length of an image in SD blocks
            constexpr uint32_t ImgBlockLen = Img::PaddedLen / SD::BlockLen;
            // cardBlockCap: the capacity of the SD card in SD blocks (1 block == 512 bytes)
            const uint32_t cardBlockCap = ((uint32_t)GetBits<69,48>(cardData)+1) * (uint32_t)1024;
            // cardImgCap: the capacity of the SD card in number of images
            const uint32_t cardImgCap = cardBlockCap / ImgBlockLen;
            
            _State.sd.imgCap = cardImgCap;
        }
        
        // Set .imgRingBufs
        {
            _State.sd.imgRingBufs[0] = {};
            _State.sd.imgRingBufs[1] = {};
        }
        
        _State.sd.valid = true;
    }
    
    // _ImgRingBufInit(): find the correct image ring buffer (the one with the greatest id that's valid)
    // and copy it into the other slot so that there are two copies. If neither slot contains a valid ring
    // buffer, reset them both so that they're both empty (and valid).
    static void _ImgRingBufInit() {
        using namespace MSP;
        FRAMWriteEn writeEn; // Enable FRAM writing
        
        MSP::ImgRingBuf& a = _State.sd.imgRingBufs[0];
        MSP::ImgRingBuf& b = _State.sd.imgRingBufs[1];
        const std::optional<int> comp = ImgRingBuf::Compare(a, b);
        if (comp && *comp>0) {
            // a>b (a is newer), so set b=a
            b = a;
        
        } else if (comp && *comp<0) {
            // b>a (b is newer), so set a=b
            a = b;
        
        } else if (!comp) {
            // Both a and b are invalid; reset them both
            a = {};
            b = {};
        }
    }
};

class _Img {
public:
    static void EnableAsync() {
        Wait();
        if (_Enabled) return; // Short-circuit
        _Enabled = true;
        
        _Scheduler::Start<_ImgTask>([] {
            // Initialize image sensor
            _ImgSensor::Enable();
            // Set the initial exposure _before_ we enable streaming, so that the very first frame
            // has the correct exposure, so we don't have to skip any frames on the first capture.
            _ImgSensor::SetCoarseIntTime(_ImgAutoExp.integrationTime());
            // Enable image streaming
            _ImgSensor::SetStreamEnabled(true);
        });
    }
    
    static void DisableAsync() {
        Wait();
        if (!_Enabled) return; // Short-circuit
        _Enabled = false;
        
        _Scheduler::Start<_ImgTask>([] { _ImgSensor::Disable(); });
    }
    
    static void Wait() {
        _Scheduler::Wait<_ImgTask>();
    }
    
private:
    static inline bool _Enabled = false;
};

// MARK: - Motion

static volatile bool _Motion = false;
static volatile bool _Busy = false;

static void _SDImgRingBufIncrement() {
    using namespace MSP;
    FRAMWriteEn writeEn; // Enable FRAM writing
    ImgRingBuf ringBufCopy = _State.sd.imgRingBufs[0];
    
    // Update write index
    ringBufCopy.buf.widx++;
    // Wrap widx
    if (ringBufCopy.buf.widx >= _State.sd.imgCap) ringBufCopy.buf.widx = 0;
    
    // Update read index (if we're currently full)
    if (ringBufCopy.buf.full) {
        ringBufCopy.buf.ridx++;
        // Wrap ridx
        if (ringBufCopy.buf.ridx >= _State.sd.imgCap) ringBufCopy.buf.ridx = 0;
        
        // Update the beginning image id (which only gets incremented if we're full)
        ringBufCopy.buf.idBegin++;
    }
    
    // Update the end image id (the next image id that'll be used)
    ringBufCopy.buf.idEnd++;
    
    if (ringBufCopy.buf.widx == ringBufCopy.buf.ridx) ringBufCopy.buf.full = true;
    
    _State.sd.imgRingBufs[0] = ringBufCopy;
    _State.sd.imgRingBufs[1] = ringBufCopy;
}

static void _ImgCapture() {
    const auto& ringBuf = _State.sd.imgRingBufs[0].buf;
    
    // Asynchronously turn on the image sensor
    _Img::EnableAsync();
    
    // Init SD card
    // This should come after we kick off Img initialization, because sometimes (after a cold start)
    // _SD::EnableAsync needs to synchronously wait for the SD card (to verify the SD card id, and
    // get its capacity if we haven't seen the SD card before). So while that's happening, we want
    // the image sensor to be initializing in parallel.
    _SD::EnableAsync();
    
    // Wait until the image sensor is ready
    _Img::Wait();
    
    // Try up to `CaptureAttemptCount` times to capture a properly-exposed image
    constexpr uint8_t CaptureAttemptCount = 3;
    uint8_t bestExpBlock = 0;
    uint8_t bestExpScore = 0;
    for (uint8_t i=0; i<CaptureAttemptCount; i++) {
        // skipCount:
        // On the initial capture, we didn't set the exposure, so we don't need to skip any images.
        // On subsequent captures, we did set the exposure before the capture, so we need to skip a single
        // image since the first image after setting the exposure is invalid.
        const uint8_t skipCount = (!i ? 0 : 1);
        
        // expBlock: Store images in the block belonging to the worst-exposed image captured so far
        const uint8_t expBlock = !bestExpBlock;
        
        // Populate the header
        static Img::Header header = {
            .magic          = Img::Header::MagicNumber,
            .version        = Img::Header::Version,
            .imageWidth     = Img::PixelWidth,
            .imageHeight    = Img::PixelHeight,
            .coarseIntTime  = 0,
            .analogGain     = 0,
            .id             = 0,
            .timeStart      = 0,
            .timeDelta      = 0,
        };
        
        header.coarseIntTime = _ImgAutoExp.integrationTime();
        header.id = ringBuf.idEnd;
        
        const MSP::Time t = _RTC.time();
        header.timeStart = t.start;
        header.timeDelta = t.delta;
        
        // Capture an image to RAM
        const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, expBlock, skipCount);
        const uint8_t expScore = _ImgAutoExp.update(resp.highlightCount(), resp.shadowCount());
        if (!bestExpScore || (expScore > bestExpScore)) {
            bestExpBlock = expBlock;
            bestExpScore = expScore;
        }
        
        // We're done if we don't have any exposure changes
        if (!_ImgAutoExp.changed()) break;
        
        // Update the exposure
        _ImgSensor::SetCoarseIntTime(_ImgAutoExp.integrationTime());
    }
    
    // Wait until the SD card is ready
    _SD::Wait();
    
    // Write the best-exposed image to the SD card
    _SD::WriteImage(bestExpBlock, ringBuf.widx);
    
    // Update _State.img
    _SDImgRingBufIncrement();
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC.isr();
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    switch (__even_in_range(P2IV, P2IV__P2IFG5)) {
    case P2IV__P2IFG5:
        _Motion = true;
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

// MARK: - ICE40

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    
    // Init SPI peripheral
    static bool spiInit = false;
    if (!spiInit) {
        spiInit = true;
        _SPI::Init();
    }
    
    // iceInit: Stored in BAKMEM (RAM that's retained in LPM3.5) so that
    // it's maintained during sleep, but reset upon a cold start.
    [[gnu::section(".ram_backup.main")]]
    static bool iceInit = false;
    
    // Init ICE comms
    if (!iceInit) {
        iceInit = true;
        // Reset ICE comms (by asserting SPI CLK for some length of time)
        _SPI::ICEReset();
        // Init ICE comms
        _ICE::Init();
    }
    
//    // Init ICE40 if we haven't done so yet
//    static bool iceInit = false;
//    if (!iceInit) {
//        // Init SPI/ICE40
//        if (Startup::ColdStart()) {
//            constexpr bool iceReset = true; // Cold start -> reset ICE40 SPI state machine
//            _SPI::Init(iceReset);
//            _ICE::Init(); // Cold start -> init ICE40 to verify that comms are working
//        
//        } else {
//            constexpr bool iceReset = false; // Warm start -> no need to reset ICE40 SPI state machine
//            _SPI::Init(iceReset);
//        }
//    }
    
    _SPI::WriteRead(msg, resp);
}

