toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
// MARK: - Power

static void _SDSetPowerEnabled(bool en) {
    _Pin::VDD_SD_EN::Write(en);
    // The TPS22919 takes 1ms for VDD to reach 2.8V (empirically measured)
    _Scheduler::SleepMs<2>();
}

static void _ImgSetPowerEnabled(bool en) {
    if (en) {
        _Pin::VDD_2V8_IMG_EN::Write(1);
        _Scheduler::SleepUs<100>(); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V9)
        _Pin::VDD_1V9_IMG_EN::Write(1);
        
        #warning measure actual delay that we need for the rails to rise
    
    } else {
        // No delay between 2V8/1V9 needed for power down (per AR0330CS datasheet)
        _Pin::VDD_1V9_IMG_EN::Write(0);
        _Pin::VDD_2V8_IMG_EN::Write(0);
        
        #warning measure actual delay that we need for the rails to fall
    }
}

// MARK: - IntState

inline bool Toastbox::IntState::InterruptsEnabled() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::SetInterruptsEnabled(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    #warning can we just inspect the state of the tasks to determine what kind of sleep to enter?
    
    // If we're currently handling motion (_Busy), enter LPM1 sleep because a task is just delaying itself.
    // If we're not handling motion (!_Busy), enter the deep LPM3.5 sleep, where RAM content is lost.
//    const uint16_t LPMBits = (_Busy ? LPM1_bits : LPM3_bits);
    const uint16_t LPMBits = LPM1_bits;
    
    // If we're entering LPM3, disable regulator so we enter LPM3.5 (instead of just LPM3)
    if (LPMBits == LPM3_bits) {
        PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
        PMMCTL0_L |= PMMREGOFF_1_L;
    }
    
    // Atomically enable interrupts and go to sleep
    const bool prevEn = Toastbox::IntState::InterruptsEnabled();
    __bis_SR_register(GIE | LPMBits);
    // If interrupts were disabled previously, disable them again
    if (!prevEn) Toastbox::IntState::SetInterruptsEnabled(false);
}

// MARK: - Tasks

//static void debugSignal() {
//    _Pin::DEBUG_OUT::Init();
//    for (int i=0; i<10; i++) {
//        _Pin::DEBUG_OUT::Write(0);
//        for (volatile int i=0; i<10000; i++);
//        _Pin::DEBUG_OUT::Write(1);
//        for (volatile int i=0; i<10000; i++);
//    }
//}

struct _BusyTimeoutTask {
    static void Run() {
        // Stay on for 1 second waiting for motion
        _Scheduler::SleepMs<1000>();
        
        // Asynchronously turn off the image sensor / SD card
        _Img::DisableAsync();
        _SD::DisableAsync();
        
        // Wait until the image sensor / SD card are off
        _Img::Wait();
        _SD::Wait();
        
        // Update our state
        _Busy = false;
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._BusyTimeoutTask")]]
    static inline uint8_t Stack[128];
};

struct _MotionTask {
    static void Run() {
        for (;;) {
            // Wait for motion
            _Scheduler::Wait([&] { return _Motion; });
            _Motion = false;
            _Busy = true;
            
            // Stop the timeout task while we capture a new image
            _Scheduler::Stop<_BusyTimeoutTask>();
            
            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
            
            // Capture an image
            _ImgCapture();
            
            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
            
            // Restart the timeout task, so that we turn off automatically if
            // we're idle for a bit
            _Scheduler::Start<_BusyTimeoutTask>(_BusyTimeoutTask::Run);
        }
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .AutoStart = Run, // Task should start running
    };
    
    // Task stack
    [[gnu::section(".stack._MotionTask")]]
    static inline uint8_t Stack[256];
};

// MARK: - Abort

namespace AbortDomain {
    static constexpr uint16_t Invalid       = 0;
    static constexpr uint16_t General       = 1;
    static constexpr uint16_t Scheduler     = 2;
    static constexpr uint16_t ICE           = 3;
    static constexpr uint16_t SD            = 4;
    static constexpr uint16_t Img           = 5;
}

[[noreturn]]
static void _SchedulerError(uint16_t line) {
    _Abort(AbortDomain::Scheduler, line);
}

[[noreturn]]
static void _ICEError(uint16_t line) {
    _Abort(AbortDomain::ICE, line);
}

[[noreturn]]
static void _SDError(uint16_t line) {
    _Abort(AbortDomain::SD, line);
}

[[noreturn]]
static void _ImgError(uint16_t line) {
    _Abort(AbortDomain::Img, line);
}

static void _AbortRecord(const MSP::Time& time, uint16_t domain, uint16_t line) {
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    auto& abort = _State.abort;
    if (abort.eventsCount >= std::size(abort.events)) return;
    
    abort.events[abort.eventsCount] = MSP::AbortEvent{
        .time = time,
        .domain = domain,
        .line = line,
    };
    
    abort.eventsCount++;
}

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line) {
    const MSP::Time time = _RTC.time();
    // Record the abort
    _AbortRecord(time, domain, line);
    // Trigger a BOR
    PMMCTL0 = PMMPW | PMMSWBOR;
    
//    PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
//    PMMCTL0_L |= PMMSWBOR_1_L;
    
    for (;;);
    
//    _Pin::DEBUG_OUT::Init();
//    
//    for (;;) {
//        for (uint16_t i=0; i<(uint16_t)domain; i++) {
//            _Pin::DEBUG_OUT::Write(1);
//            _Pin::DEBUG_OUT::Write(0);
//        }
//        
//        for (volatile int i=0; i<100; i++) {}
//        
//        for (uint16_t i=0; i<(uint16_t)line; i++) {
//            _Pin::DEBUG_OUT::Write(1);
//            _Pin::DEBUG_OUT::Write(0);
//        }
//        
//        for (volatile int i=0; i<1000; i++) {}
//    }
}

extern "C" [[noreturn]]
void abort() {
    _Abort(AbortDomain::General, 0);
}

// MARK: - Main

#warning verify that _StackMainSize is large enough
#define _StackMainSize 128

[[gnu::section(".stack.main")]]
uint8_t _StackMain[_StackMainSize];

asm(".global __stack");
asm(".equ __stack, _StackMain+" Stringify(_StackMainSize));

